app/controllers/companies_controller.rb

  def index
    render json: { data: Company.all }
---
SELECT "companies".* FROM "companies"

  def alphabetically
    render json: { data: Company.order(:name)}
---
SELECT "companies".* FROM "companies" ORDER BY "companies"."name" ASC

  def with_modern_plan
    render json: { data: Company.where.not(plan_level: ['custom', 'legacy']) }
---
SELECT "companies".* FROM "companies" WHERE ("companies"."plan_level" NOT IN ('custom', 'legacy'))

  def not_trialing
    render json: { data: Company.all.map{|x| x.trial_status ? nil : x }.compact}
---
SELECT "companies".* FROM "companies"

  def created_last_month
    last_month = (Date.today << 1).month
    last_month_year = (last_month.month == 12 ? Date.today.prev_year : Date.today.year)
    companies_created_last_month = Company.all.map{ |x|
---
SELECT  "companies".* FROM "companies" ORDER BY "companies"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "companies"